## Agrupamientos

A partir del dataset de los pinguinos, calcular el promedio de masa corporal, por especie e isla.

In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
penguins = sns.load_dataset("penguins")

In [6]:
penguins.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [21]:
df=penguins.groupby(['species','island'])['body_mass_g'].mean().reset_index()
df.set_index('species', inplace = True)
df

              island  body_mass_g
species
Adelie        Biscoe  3709.659091
Adelie         Dream  3688.392857
Adelie     Torgersen  3706.372549
Chinstrap      Dream  3733.088235
Gentoo        Biscoe  5076.016260

## Tabla Pivot

Generar una tabla Pivot que muestre el promedio de la masa corporal (body_mass_g) entre las columnas species y island.

Y crear una tercera dimensión con la columna bill_depth_mm, discretizada con 3 cuartiles, etiquetados como chico, medio y grande.

In [23]:
penguins.pivot_table("body_mass_g", columns= "species", index="island")

species         Adelie    Chinstrap      Gentoo
island
Biscoe     3709.659091          NaN  5076.01626
Dream      3688.392857  3733.088235         NaN
Torgersen  3706.372549          NaN         NaN

In [24]:
bill_categories = pd.qcut(penguins.bill_depth_mm, 3, labels = ["chico","medio","grande"])

In [30]:
penguins.pivot_table("body_mass_g", "species", [bill_categories,"island"], fill_value = "No existen")

bill_depth_mm        chico                                medio               \
island              Biscoe       Dream   Torgersen       Biscoe        Dream
species
Adelie              3212.5      2975.0      3300.0       3497.5       3535.0
Chinstrap       No existen  No existen  No existen   No existen  3559.848485
Gentoo         5012.727273  No existen  No existen  5611.538462   No existen

bill_depth_mm                    grande
island           Torgersen       Biscoe        Dream    Torgersen
species
Adelie         3510.869565  3947.727273  3869.827586  3910.576923
Chinstrap       No existen   No existen  3896.428571   No existen
Gentoo          No existen   No existen   No existen   No existen

In [42]:
# Merge
# A partir de los siguientes dataframes, generar los cuatro tipos de joins entre ellos.

df_left = pd.DataFrame(
    {
        "pais": ["Brasil", "Paraguay", "Peru"],
        "pop": ["210.461.000", "7.104.000", "32.362.000"],
        "covid_muertos": ["261.000", "3.200", "47.000"],
    }
)

df_right = pd.DataFrame(
    {
        "pais": ["Argentina", "Brasil", "Peru"],
        "capital": ["Buenos Aires", "Brasilia", "Lima"],
        "flor": ["ceibo", "ipé amarillo", "kantuta"],
    }
)

In [52]:
df_left

       pais          pop covid_muertos
0    Brasil  210.461.000       261.000
1  Paraguay    7.104.000         3.200
2      Peru   32.362.000        47.000

In [53]:
df_right

        pais       capital          flor
0  Argentina  Buenos Aires         ceibo
1     Brasil      Brasilia  ipé amarillo
2       Peru          Lima       kantuta

In [50]:
df_1 = pd.merge (df_left, df_right, on = "pais", how="inner")
df_1

     pais          pop covid_muertos   capital          flor
0  Brasil  210.461.000       261.000  Brasilia  ipé amarillo
1    Peru   32.362.000        47.000      Lima       kantuta

In [51]:
df_2 = pd.merge(df_left, df_right, on="pais", how="outer")
df_2

        pais          pop covid_muertos       capital          flor
0     Brasil  210.461.000       261.000      Brasilia  ipé amarillo
1   Paraguay    7.104.000         3.200           NaN           NaN
2       Peru   32.362.000        47.000          Lima       kantuta
3  Argentina          NaN           NaN  Buenos Aires         ceibo

In [55]:
df_3 = pd.merge(df_left, df_right, on="pais", how="left")
df_3

       pais          pop covid_muertos   capital          flor
0    Brasil  210.461.000       261.000  Brasilia  ipé amarillo
1  Paraguay    7.104.000         3.200       NaN           NaN
2      Peru   32.362.000        47.000      Lima       kantuta

In [58]:
df_3 = pd.merge(df_left,df_right, on= "pais", how="right")
df_3

        pais          pop covid_muertos       capital          flor
0  Argentina          NaN           NaN  Buenos Aires         ceibo
1     Brasil  210.461.000       261.000      Brasilia  ipé amarillo
2       Peru   32.362.000        47.000          Lima       kantuta